/******************************************************************************
** Copyright 
** 文件名:  sample.h
** 描 述:   样本模块接口头文件
** 修改记录:
*******************************************************************************/
#ifndef INC_SAMPLE_API_INC
#define INC_SAMPLE_API_INC

/*****************************************************************************
* @name         sample_one
* @brief        示例1
* @param[in]    uint16_td u16x 增量
* @param[out]   无
* @return       无
* @note         无
*****************************************************************************/
void sample_one( uint16_td u16x );

/*****************************************************************************
* @name         sample_two
* @brief        示例2
* @param[in]    uint16_td u16x 增量
* @param[out]   无
* @return       无
* @note         无
*****************************************************************************/
void sample_two( uint16_td u16x );

/*****************************************************************************
* @name         sample_three
* @brief        示例3
* @param[in]    uint16_td u16step 增量
* @param[in]    uint16_td *pu16ip 字指针
* @param[out]   uint16_td *pu16ip 字指针
* @return       无
* @note         无
*****************************************************************************/
void sample_three( uint16_td * pu16ip, uint16_td u16step );

/*****************************************************************************
* @name         sample_four
* @brief        示例4
* @param[in]    无
* @param[out]   无
* @return       无
* @note         开始计时[0,0xFFFF]，单位:秒
*****************************************************************************/
void sample_four(void);

#endif /* INC_SAMPLE_API_INC */

